{
    "qualtrics": {
        "name": "Qualtrics",
        "position": "Software Engineering Intern",
        "period": "Summer 2020",
        "link": "https://www.qualtrics.com",
        "location": "Remote (orig. Downtown Seattle, WA)",
        "technologies": ["Scala", "Elasticsearch", "Nomad", "Jenkins"],
        "details": "At Qualtrics, I was on Analytics Platform, the primary distributed systems team for efficiently storing and processing all of Qualtric's large datasets. I built an estimator that predicts how long it takes to rebuild a dataset due to schema changes, using historical build data. Because a user's dashboard must temporarily go down during a build, this also helps clients know when their dashboards can become usable again. In addition, I also built separate compactor and deleter jobs to help compact and trim historical data, saving DB space and estimate calculation time by up to 10x.",
        "width": 250
    },
    "girs": {
        "name": "UCLA Garrick Institute of Risk Sciences",
        "position": "Software Engineer",
        "period": "Nov 2018 - Aug 2020",
        "link": "https://risksciences.ucla.edu",
        "location": "West Los Angeles, CA",
        "technologies": ["React", "Node", "Puppeteer", "Docker", "Django", "PostgreSQL", "MongoDB"],
        "details": "At GIRS, I developed risk engineering tools used by NASA JPL, Japan's Nuclear Regulation Authority, and PG&E. My most significant project was leading the design and implementation of a backend for assessing the ignition risk of PG&E powerlines based on geographic conditions. Before that, I worked on mostly frontend/fullstack projects, from independently creating and deploying automated report generators for risk models to adding platform-wide internationalization.",
        "width": 350
    },
    "houzz": {
        "name": "Houzz",
        "position": "Software Engineering Intern",
        "period": "Summer 2019",
        "link": "https://houzz.com",
        "location": "Santa Monica, CA",
        "technologies": ["React", "PHP", "SQL", "GraphQL", "Thrift", "Java"],
        "details": "At Houzz, I worked on the Marketplace Ads Team and Trade Growth team. In my time there, I worked on a project to add new legal consent components for advertisers on houzz.com, helped build a platform to appropriately price vendors' products on the website, and implemented site perks to promote the Houzz Trade program for professional users.",
        "width": 150
    },
    "census": {
        "name": "US Census Bureau",
        "position": "Software Development Intern",
        "period": "Summer 2018",
        "location": "Washington, DC",
        "link": "http://census.gov",
        "technologies": ["HTML", "CSS", "jQuery", "Java", "SAS"],
        "details": "At the Census, I worked with a team of ~20 analysts and developers to develop and maintain an internal website used to store data and extract statistics from the Commodity Flow Survey. I also helped to clean the data used for their shipment calculation software, improving the accuracy of its results.",
        "width": 150
    },
    "jhuapl": {
        "name": "Johns Hopkins University Applied Physics Laboratory",
        "position": "High School ASPIRE Intern",
        "period": "Summer 2015",
        "link": "https://www.jhuapl.edu/",
        "location": "Laurel, MD",
        "technologies": ["MATLAB", "Java"],
        "details": "At APL, I contributed to an intern project where moving robots communicated with each other as a swarm to explore and map out their environment. I helped on creating the virtual environment as a test for the robot's algorithms, running tests on physical environments, and writing sections of the research paper.",
        "width": 180
    }
}