{
    "qualtrics": {
        "name": "Qualtrics",
        "position": "Software Engineering Intern",
        "period": "Summer 2020",
        "link": "https://www.qualtrics.com",
        "location": "Remote (orig. Downtown Seattle, WA)",
        "technologies": ["TBD"],
        "details": "Data Analytics Platform and Distributed Systems Team",
        "width": 250
    },
    "girs": {
        "name": "UCLA Garrick Institute of Risk Sciences",
        "position": "Software Engineer",
        "period": "Since Nov 2018",
        "link": "https://risksciences.ucla.edu",
        "location": "West Los Angeles, CA",
        "technologies": ["React", "Node", "Puppeteer", "Docker", "Django", "PostgreSQL", "MongoDB"],
        "details": "At GIRS, I develop risk engineering tools used by NASA JPL, Japan's Nuclear Regulation Authority, and PG&E. I worked on projects across both backend and frontend, from automated report generators for risk models to platform-wide internationalization to UI components for troubleshooting. Currently, I'm working on quantifying the risk of fires caused by power stations and powerlines due to terrain features and weather conditions.",
        "width": 350
    },
    "houzz": {
        "name": "Houzz",
        "position": "Software Engineering Intern",
        "period": "Summer 2019",
        "link": "https://houzz.com",
        "location": "Santa Monica, CA",
        "technologies": ["React", "PHP", "SQL", "GraphQL", "Thrift", "Java"],
        "details": "At Houzz, I worked on the Marketplace Ads Team and Trade Growth team. In my time there, I worked on a project to add new legal consent components for advertisers on houzz.com, helped build a platform to appropriately price vendors' products on the website, and implemented site perks to promote the Houzz Trade program for professional users.",
        "width": 150
    },
    "census": {
        "name": "US Census Bureau",
        "position": "Software Development Intern",
        "period": "Summer 2018",
        "location": "Washington, DC",
        "link": "http://census.gov",
        "technologies": ["HTML", "CSS", "jQuery", "Java", "SAS"],
        "details": "At the Census, I worked with a team of ~20 analysts and developers to develop and maintain an internal website used to store data and extract statistics from the Commodity Flow Survey. I also helped to clean the data used for their shipment calculation software, improving the accuracy of its results.",
        "width": 150
    },
    "jhuapl": {
        "name": "Johns Hopkins University Applied Physics Laboratory",
        "position": "High School ASPIRE Intern",
        "period": "Summer 2015",
        "link": "https://www.jhuapl.edu/",
        "location": "Laurel, MD",
        "technologies": ["MATLAB", "Java"],
        "details": "At APL, I contributed to an intern project where moving robots communicated with each other as a swarm to explore and map out their environment. I helped on creating the virtual environment as a test for the robot's algorithms, running tests on physical environments, and writing sections of the research paper.",
        "width": 180
    }
}